Documents/ESB/ESB_Consumer_0819/003TestSample/SAMPLE_XML_MUST/DebitCard/DC09_CardModRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://https://www.nextbank.com.tw//xsd/TW/DebitCard/CardModRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>DebitCard</ServiceDomain>  
      <OperationName>CardMod</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:CardModRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>DC09</v11:TxnId>  
        <v11:TxnNo>DC0900001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:CardNo>4563020616112800</v11:CardNo>  
        <v11:BlkCode1>1</v11:BlkCode1>  
        <v11:UpdtDate>20190608</v11:UpdtDate>  
        <v11:UpdtTime>115814</v11:UpdtTime>  
        <v11:UpdtUserID>user1</v11:UpdtUserID>  
        <!--Optional:-->  
        <v11:LostFeeFlg>Y</v11:LostFeeFlg> 
      </v11:ServiceBody> 
    </v11:CardModRq> 
  </soap:Body> 
</soap:Envelope>
